{"data" : [
  {
    "recipeName": "Banana sabe",
    "ingredients": "2 cups sugar\n 1 cup shortening \n 10 ripe bananas\n 4 eggs\n 2 cups and 4 tbsp flour\n 1 tsps baking powder\n 1 tsp salt",
    "procedure": "Grease pan with flour. Preheat oven to 375. Bake until brown.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Beef Steak and Bamboo Shoots",
    "ingredients": "_ can bamboo shoots\n _ lb beef steak (sirloin, round filet)\n 1 green pepper, cut in strips\n _ cup dried onions\n 1 clove garlic, crushed\n 2 tbsp soy sauce\n 1 tsp accent\n _ cup water, salt and pepper\n 1 carrot cut in strips",
    "procedure": "Cut steak in narrow strips, 2 inches long. Do the same to the bamboo shoots. Saute garlic, onion and beef. Cook enough to turn meat brown, about five minutes. Set aside. Cook bamboo shoots, green pepper and carrot on strips, about 5 minutes. Add soy sauce and accent. Mix the sauteed beef, add water, salt and pepper and cook on another 5 minutes.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Bibingka (small)",
    "ingredients": "1 cup mochiko \n 1 cup sugar\n 1 cup milk\n _ cup shredded coconut\n _ bar butter\n _ tsp baking powder\n 3 eggs\n 3 tbsp grated philadelphia cream cheese",
    "procedure": "Mix all ingredients. Bake at 350 for 45 minutes. When done, top with coconut shredded, sweetened. If adding sugar to the coconut, broil for a couple of minutes.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Bibinkga (large)",
    "ingredients": "4 eggs beaten until fluffy\n 1 stick of melted butter or margarine\n 1 tall can evaporated milk\n 1 cup sugar\n 1 tbsp baking powder\n 1box mochiko\n 1 tbsp lemon extract\n 1 bottle macapuno",
    "procedure": "Bake at 300 for 1 hour. UNFINISHED",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Bulanglang",
    "ingredients": "1 cup squash\n 1 cup upo\n _ tbsp bagoong\n 1 sq bean curd (tokua)\n 1 small onion\n 1 small tomato\n 1 cup rice water\n Tbsp patis",
    "procedure": "In a sauce pan, combine the tomato, onion, bagoong and the kalabasa (squash) cut into squares. Add the rice water and simmer for 5 minutes. Add the tokua and upo and when cooked, season with salt, patis to taste.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Buquillos Lumpia Frito",
    "ingredients": "_ lb ground pork\n _ cup shrimp\n 2 cloves garlic crushed\n _ cup chopped celery keaves\n _ medium size cabbage cut fine\n 1 small onion sliced\n 1 tbsp soy sauce\n 1 cup potatoes\n Cooking oil\n Lumpia wrapper\n Salt and pepper",
    "procedure": "Place pork in frying pan and cook until done. Add the garlic, onion, shrimps, potatoes, celery, soy sauce, salt and pepper. Wrap in prepared lumpia wrapper and deep fryServe with vinegar, salt and crushed garlic.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Camaron Rebosado with Ham",
    "ingredients": "1 lb medium sized shrimps, deveined\n 2 eggs\n 1 lemon for juice\n 1 lb ham slices\n _ cup cornstarch\n Salt and pepper\n _ tbsp baking powder",
    "procedure": "Devein shrimps and spread open by cutting the back lengthwise. Squeeze the juice of the lemon on the shrimp, add salt and pepper and let aside. Beat the egg, add the cornstarch to make a thick batter. When ready to deep fry, place a strip of ham under each opened shrimp, dip in batter and deep fry. Serve with pickled relish.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Carne Frita",
    "ingredients": "1lb of pork, sliced thin\n Bread crumbs\n Salt and pepper",
    "procedure": "Bread the pork that has been sliced thin. Season with salt and pepper and fry until done. Garnish with fried potato cubes.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Cassava Cake",
    "ingredients": "1 cassava pack\n 1 can condensed milk for topping\n 2 eggs\n Butter for the baking tin\n 1 can coconut milk\n _ macapuno\n _ langea\n _ sugar",
    "procedure": "Mix ingredients together and bake at 350. Put condensed milk on top and bake again until brown.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Chicken and pineapple",
    "ingredients": "1 chicken\n _ cup of flour\n 1 clove garlic, crushed\n 1 medium sized can of pineapple chunks\n 2 tbsp soy sauce\n _ cup vinegar\n Salt and pepper, accent",
    "procedure": "Clean chicken and cut into serving pieces. Dry with paper towel. Roll chicken in the flour, salt, pepper and accent mixture and set aside. In a saucepan, saute garlic and chicken, pineapple chunks and _ of the pineapple juice, cover and cook about 5 minutes. With the remaining pineapple juice, add soy sauce, flour and vinegar. Pour over sauteed chicken and cook until sauce thickens.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Chicken and Pineapple",
    "ingredients": "1 chicken\n _ cup flour\n 1 clove garlic, crushed\n 1 medium sized pineapple chunks\n 2 tbsp cup white vinegar\n Salt and pepper",
    "procedure": "Clean chicken and cut into serving pieces. Dry with paper towel. Roll chicken in the flour, salt and pepper, and accent mixure and set aside. In a saucepan, saute the garlic and chicken with pineapple chunks with _ of the pineapple juice. Cover and cook for 5 minutes. With the remaining pineapple juice, add soy sauce, flour and vinegar, pour over sauteed chicken, blend and cook until sauce thickens.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Chicken asado",
    "ingredients": "1 Chicken\n 1 small can tomato sauce\n _ cup chopped onion\n 1 clove garlic, crushed\n 1 small can mushroom cut ---?\n 8 peppercorns\n _ cup white vinegar\n 1 bay leaf\n Salt and pepper",
    "procedure": "Clean chicken and cut into serving --? Pieces. Simmer in vinegar, tomato sauce, garlic, onion, peppercorn, salt and pepper and put enough water to cover chicken. Cook until liquid has evaporated. Add mushrooms --? To cook 5 more minutes. Garnish with fine cubed potatoes and pimiento strips.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Chicken Cacciatore",
    "ingredients": "1 chicken\n _ cup tomato sauce\n 1 cup water\n 1 tbsp oregano\n 1 small chopped onion\n 1 clove garlic crushed\n _ cup green pepper, chopped\n 1 tbsp accent\n Salt and pepper",
    "procedure": "Clean chicken, cut into serving pieces and deep fry until brown. Set aside. Saute garlic and onion, tomato sauce, green peppers, oregano, accent, salt and pepper. Add the chicken and water, simmer until liquid has partially evaporated.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Chicken Curry",
    "ingredients": "1 chicken\n _ tbsp curry powder\n _ cup coconut milk\n 1 onion, chopped\n 2 tbsp margarine\n 1 tbsp accent\n Salt and pepper to taste",
    "procedure": "Clean chicken and cut into serving pieces. Fry and set aside. Brown onion, add chicken, curry powder, coconut milk and cook until chicken is done and sauce becomes thick. Add the accent, salt and pepper to taste.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Chicken Fried, Filipino Style",
    "ingredients": "1 chicken\n _ cup white vinegar\n 1 cup water\n 1 tsp accent\n 2 cloves garlic, crushed\n Salt and pepper",
    "procedure": "Clean and cut chicken into serving pieces. Simmer in vinegar, water, garlic, salt, accent and pepper until almost done. Drain excess liquid, keep fat, fry chicken until brown.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Chicken Guinataan",
    "ingredients": "1 chicken cut in serving pieces\n _ cup white vinegar\n 2 cloves garlic, crushed\n _ cup water\n 1 can coconut milk, fresh, frozen or canned\n Salt and pepper",
    "procedure": "Cut and clean chicken. Place in a saucepan. Add salt, pepper, vinegar, garlic, water and coconut milk. Cook on low heat until practically all liquid has evaporated and sauce remains.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Chicken Lang Lang",
    "ingredients": "1 chicken\n _ lb shelled and deveined shrimps\n _ cup dried mushrooms\n 1 small package sotanghon\n 1 small onion, chopped\n 2 gloves garlic, crushed\n 2 tbsp patis\n _ lb snow peas\n 1 tbs accent\n Salt and pepper",
    "procedure": "Clean chicken and cut into serving bite size pieces. Soak dried mushroom and sotanghon in water. \n (UNFINISHED)",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Chicken Loaf",
    "ingredients": "Meat of 1 chicken\n 1lb ground pork\n 1 chorizo\n 1 onion\n 1 garlic\n 4 seedless tomatoes\n 4 eggs\n 1 cup breadcrumbs or _ cup oatmeal\n _ cup milk",
    "procedure": "Clean the chicken and grind the meat with the sausage, onions, tomatoes and mix thoroughly with the breadcrumbs or oatmeal. Add the eggs, salt, pepper, milk and garlic. Place in a well greased loaf pan or Pyrex bread an. Bake in moderate oven until loaf is firm but not dry. Slice before serving.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Chicken Peas",
    "ingredients": "1 stewing chicken\n 2 medium sized potatos or upo\n _ onion cut in wedges\n 8 peppercorns\n _ small cabbage\n 1 pechay\n 1 green onion (cebullins)\n Salt",
    "procedure": "Clean chicken and cut into serving pieces. Boil chicken in enough water to cover the onion, potatoes, peppercorn and salt to taste. When the chicken is tender, add the cabbage, pechay, and the green onions.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Chicken Pochero",
    "ingredients": "1 chicken\n 1 small tomato sauce\n 1 small onion, diced\n 1 medium sized can garbanzos\n 8 peppercorn\n _ small cabbage\n 1 pechay (bokchoy)\n 2 small potatoes cut in four pieces\n 1 chinese sausage or chorizo de Bilbao\n 1 clove garlic, crushed\n 1 banana saba\n Salt and pepper",
    "procedure": "Stew chicken in enough water to cook. Add sausage, peppercorn and salt until done. Drain the juice and set aside. Boil the banana separately and peel after cooking. Set aside using the drained juice of the chicken. Cook the potatoes until done, add the pechay and cabbage and set aside. Saute the garlic, onion, tomato sauce and the chicken. Add _ cup of water and the remaining ingredients. Before serving the chicken, garnish with cabbage, pechay and potatoes.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Chicken Stew Nilaga",
    "ingredients": "1 chicken\n 8 peppercorns\n 1 stalk celery\n 1 pechay\n 1 green onion (cebollin)\n _ cabbage\n _ small onion, cut in 4\n 1 tsp accent, salt to taste",
    "procedure": "Clean chicken and divide into serving pieces. Boil enough water to cover the chicken. When the water is boiling, drop the chicken parts. Add onions, peppercorns, celery, and accent. Simmer until the chicken is done. Add the cut up cabbage wedges, pechay and green onions and boil until the vegetables are done but not overcooked.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Chicken Tinola",
    "ingredients": "1 chicken\n 1 large potato cut in cubes\n 2 gloves garlic, crushed\n 1 small piece ginger, crushed\n 1 tbsp salt, 1 tbsp patis\n 3 cups rice water\n Upo cut into cubes",
    "procedure": "Clean chicken and cut into serving pieces. Saute garlic, onion, ginger, and add chicken pieces and potatoes. Season with patis and continue to cook until chicken and potatoes are tender. If upo is available, this should be added last and let it come to a boil and remove from heat.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Chicken with Fresh Mushroom",
    "ingredients": "2 chicken breasts\n 1 lb fresh mushrooms\n _ cup water\n 1 clove garlic, crushed\n _ cup onion\n 1 tbsp patis\n 1 tsp accent\n Salt and pepper to taste",
    "procedure": "Clean chicken breasts and cut into small pieces. Saute garlic, onion, chicken and season with patis, salt, accent and pepper. Add the cut up mushrooms to the water and simmer until chicken and mushrooms are done in about 8-10 minutes.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Chicken with Sotanghon",
    "ingredients": "1 chicken\n 1 small onion, diced\n 2 cloves garlic, crushed\n 2 tbsp butter\n 1 tsbp achuete\n 1 tbsp patis\n _ cup dried mushroom\n 1 small package sotanghon\n Green onions, chopped fine\n Salt, pepper, 1 tbsp accent",
    "procedure": "Cut sotanghon 4 inches in length and soak in water. Also cut mushrooms in pieces and soak in water. Soak achuete in _ cup of lye water. Boil chicken until tender and debone. Shred into bite pieces. Saute garlic, onions, chicken and season with patis. Simmer about 10 minutes. Add drained achiote and chicken broth and let it come to a boil. Drain sotanghon and mushroom and add salt and pepper to taste. Garnish with finely chopped onion before serving.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Chop Suey",
    "ingredients": "_ lb shrimp, deveined\n 1 medium size chicken breast\n 1 cup cooked pork or chicken liver and gizzard\n 1 small green pepper\n 1 clove garlic shredded\n 1 medium size carrot\n 1 _ cup celery\n 1 medium size onion\n _ cup medium sized cabbage\n 1 _ cups of cauliflower\n 1/4 cup soy sauce\n _ cup water \n 2 tbsp cornstarch\n 1 tsp accent\n Salt and pepper",
    "procedure": "Shell, clean and deveined shrimps. Cut lengthwise and set aside. Cut chicken to small pieces. Cook the chicken gizzards until tender and cut to the same size of the chicken hearts. Prepare the vegetables. Cut pepper lengthwise and cut crosswise. Cut the celery lengthwise and into medium sizes. Cut the celery at an angle in medium sizes and do likewise to the cabbage and cauliflower. Onions should be cut in quarters.\n Saute the garlic, cauliflower, celery, shrimp and cook until done. Add the carrots, cover and cook for 5 minutes. Add the onions, green pepper and cabbage last. Prepare the sauce by combining the soy sauce, water and cornstarch. Pour over the sauteed mixture. Add accent and season with salt and pepper. Simmer for about 2 minutes and remove from the heat.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Crab tortilla",
    "ingredients": "1 can crab meat\n 1 clove garlic crushed\n 1 egg and small onion\n 1 small tomato, fine\n Accent, salt and pepper",
    "procedure": "Saute garlic, onion, tomato and crab meat. Separate the yolk from the white of the egg. Beat the egg white until stiff. Add the yolk and beat some more. Place half of the beaten egg in a deep plate and put the sauteed crab meat, then slide mixture on a heated skillet with grease, cook on one side then slide it back to plate. Cover the other side with the other half of the beaten eggs, cover with another plate and slide it back to the skillet to cook the other side. Cut in squares before serving.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Custard",
    "ingredients": "8 egg yolks\n 1 can condense milk\n 1 can evaporated milk\n 1 cup sugar\n 1 tsp vanilla",
    "procedure": "Carmelize the sugar in a sauce pan. Pour to the baking tin. Beat the mixture of egg yolks, condensed milk, and evaporated milk and tsbp vanilla. Steam it in the oven. Baking tin will be on the deep pan with water for 60 minutes.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Dinugu-an",
    "ingredients": "4 cups of hog internal organs\n 1 _ cup of hog blood\n _ cup of white vinegar mixed with 1 tsp salt and 1 cup of water\n 1 small onion diced\n 1 clove garlic, crushed\n 2 hot peppers\n 3 _ cups water",
    "procedure": "Clean and cut the internal organs into small pieces. Simmer in low heat with vinegar until tender. Set aside. Saute the garlic, onion and add the boiled internal organs, cook about 15 minutes. Add the blood and stir constantly to prevent the blood from coagulating. Add the water and season with salt and cook for 10 minutes more then add the hot pepper before removing from the heat. Serve hot with puto.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Fish Escabeche",
    "ingredients": "1 medium size bass\n 1 medium onion\n 2 cloves garlic\n 1 cup white vinegar\n 1 cup water\n _ cup sugar\n 1 sweet red pepper, cut into strips\n 1 1-inch fresh ginger sliced thin\n 2 tbsp starch",
    "procedure": "Clean and fry the fish until brown. Saute garlic, onion, ginger, then add the vinegar, water and sugar and let simmer for 5 minutes. Add the fried fish, sweet red pepper, cover and simmer for 3 minutes. Add the cornstarch, mixed with a small amount of water and blend with the fish until it thickens.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Fish Sarciado",
    "ingredients": "1 medium sized bass fish\n 3 cloves garlic, crushed\n _ cup onion, chopped fine\n _ cups tomatoes, chopped fine\n 2 tbsp chopped green onions, cebollin",
    "procedure": "Scale and clean the fish. Salt and fry. Saute garlic, onions, tomatoes and cook until thick. Salt to taste. Remove from the heat and pour over fish. Garnish with green onions.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Fresh Lumpia - Babong(?)",
    "ingredients": "_ lb shrimp\n _ lb pork\n 1 big can bamboo shoots\n 1 clove garlic crushed\n 1 small onion diced\n 1 tsp accent, salt and pepper",
    "procedure": "Devein shrimps and cut into small pieces. Wash pork and cook in small amounts of water, well done then cut to small pieces. Cut bamboo shoots in thin long stripes. Saute garlic, onion, shrimps, and pork for about 10 minutes. Then add bamboo shoots, accent and salt and pepper. Cook for another 5 minutes. When ready to wrap, drain very well. On a plate, lay each wrapper, place a segment of lettuce leaf, put 2 tbsp of the filling on top of the lettuce leaf on the middle of the wrapper and roll. Seal with the sauce and place edge down. Serve with lumpia sauce and crushed fresh garlic.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Gulaman(1)",
    "ingredients": "2 cups water to 1 stick gulaman\n _ cup of sugar\n _ cup pineapple\n 1 banana\n 4 slices ripe mango\n _ cup milk",
    "procedure": "Boil sugar and gulaman. Remove from fire and pass through a strainer. Add milk and put 1 cup of the mixture in a wet mold. Put in a cool place.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Gulaman(2)",
    "ingredients": "1 gulaman\n 1 cup sugar\n 1 cup water\n _ cup milk (Carnation)\n 1 tsp vanilla or lemon extract",
    "procedure": "Soak gulaman in water until soft. Boil in 1 cup water until melted. Add sugar and cook 10-15 minutes. Add vanilla and milk. Fruit cocktail, sliced pineapples in a mold. Add second layer when formed.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Italian cookies",
    "ingredients": "6 eggs\n 3 _ cup flour\n 2 _ tsp. baking powder\n 1 cup sugar\n 1 cup milk\n 1 cup baked almonds\n 5 tbsp butter",
    "procedure": "Mix all ingredients and beat eggs and put milk, almonds, sugar, butter to the mixture. Then mix into dough. Spread the dough in a rectangle pan. Bake for 350 then slice crosswise.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Kare-kare",
    "ingredients": "_ lb tripe\n 2 oxtail\n 2 medium sized eggplants\n 5 yardlong beans (sitao)\n 1 tbsp achuete\n _ cup peanut butter\n _ cup toasted rice flour\n Salt to taste",
    "procedure": "In a pressure cooker, place tripe and oxtail and cook until tender. Set aside. Slice the eggplant in serving pieces. Cut the sitao 2 inches long. Soak the achuete in _ cup of water with a few drops of lye water to extract the juice. Add the vegetables to the tripe and oxtail. Season with salt. Add the peanut butter and the toasted rice powder.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Kinilaw Oysters",
    "ingredients": "1 pint oysters\n _ cup vinegar (white)\n 5 shallots (small purple onions)\n 2 cloves garlic, crushed\n Salt to taste",
    "procedure": "Bring vinegar, garlic, onions and salt to a boil. Add the oysters then bring to a boil. Remove from the heat.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Leche flan Custard",
    "ingredients": "1 can condensed milk\n 6 egg yolks\n 1 tsp lime rind\n 1 can water equal to condensed milk\n Caramel - 1 cup white sugar and tbsp water",
    "procedure": "Place sugar and water in a sauce pan and caramelize over low heat. When sugar turns golden brown, pour in prepared mold. Beat egg yolk lightly, add milk and water and the lime rind and blend very well. Pour in mold. Half fill the pan with water and steam for 5 minutes until firm or brown. To test doneness, insert a knife in mixture and if it comes out clean, custard is done.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Lumpia Sauce",
    "ingredients": "4 tbsp cornstarch\n _ cup sugar\n _ cup soy sauce\n 1 _ cup water",
    "procedure": "Combine cornstarch, sugar, soy sauce and water. Cook over low flame, constantly stirring to prevent lumps. When done, serve with crushed garlic.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Meatloaf",
    "ingredients": "_ lb ground beed\n _ cup chopped onions\n 2 eggs\n _ cup bread crumbs\n 1 tsp accent\n _ cup fresh milk\n Salt and pepper",
    "procedure": "Combine the ingredients and place the mixture in a well greased loaf pan. Bake in a moderate oven for 2 _ hours until meat is done.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Menudo",
    "ingredients": "2 _ cups pork tenderloin, diced\n 1 cup diced liver\n 3 cubed potatoes\n 1 small can skinned garbanzos\n 1 medium sized tomato\n 2 cloves garlic\n 1 medium onion, sliced\n 1 tsp paprika\n Salt and pepper",
    "procedure": "Boil the pork until tender. Slice and sautree the garlic, onions and tomatoes. Add the pork and liver and continue to cook about 5 more minutes. Add the water, salt and paprika. Add the cubed potatoes and garbanzos. Cook until the potatoes are done.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Menudo (2)",
    "ingredients": "Diced pork\n Garbanzos\n Raisins\n Diced potatoes\n Carrots",
    "procedure": "Boil pork with vinegar and soy sauce. Fry potatoes. Saute garlic, onions and tomatoes. Put pork and fried potatoes, garbanzos and raisins. Add salt and pepper to taste.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Monggo Guisado",
    "ingredients": "_ lb shelled shrimp, cut in pieces\n _ cup mongo\n 1 clove garlic, crushed\n 1 small onion diced\n 2 small fish (tinapa), flaked(?)\n 1 medium sized tomato, chopped\n Ampalaya leaves (optional)\n Patis",
    "procedure": "Soak green mongo over -- water\n Wash and boil until mongo is done\n Sautee garlic, onions, tomato and shrimps\n Add the tinapa and mongo last\n Season with patis\n If amapalaya leaves are available, add the leaves, cover and simmer for 5 minutes",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Pancit Mami",
    "ingredients": "_ lb fresh miki (noodle)\n _ cup shredded pork\n _ cup cooked chicken meat, (flaked)\n 2 tbsp chopped green onion\n 1 clove garlic\n 3 cups chicken stock or broth\n 1 tsp accent, salt, pepper",
    "procedure": "Boil the pork and chicken in water. Add salt and accent, cook until tender. Saute garlic until brown. Add the chicken and the pork over what has been drained from the stock or broth and cover. Boil enough water to cook the miki. Place miki in individual bowl and pour some of the broth. Add the sauteed pork and chicken. Garnish with chopped green onion - Serve hot.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Pata crispy",
    "ingredients": "1 pig�s feet (knuckles), medium sized\n Salt and bay leaf",
    "procedure": "Boil pata in enough water, add salt, bay leaf and cook until tender. Deep fry until the skin is crispy. Serve with achara.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Picadillo",
    "ingredients": "_ lb ground beef\n 1 medium sized tomato, chopped fine\n 1 clove garlic, crushed\n 1 medium sized onion, chopped fine\n 1 potato cut in small cubes\n 3 cups water \n Salt and pepper",
    "procedure": "Saute the garlic, onion, tomato, ground beef and season with salt to taste. Cover and simmer until the meat is done. Add the water.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Pinakbet",
    "ingredients": "3 medium eggplants\n 1 medium sized ampalaya\n 1 large tomato\n 1 onion\n 3 tbsp bagoong\n 1 cup pork diced\n 2 cloves garlic, crushed\n 1 cup rice water",
    "procedure": "Cut eggplants and ampalaya lengthwise and then crosswise. Saute garlic, onion, tomato and bago-ong and pork. Simmer until pork is done. Add the eggplant and the ampalaya. Cover with rice water and simmer until vegetables are done. Season with patis.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Puto Maya",
    "ingredients": "3 cups rice malagkit\n 5 cups water\n 1 cup grated coconut\n 1 cup sugar",
    "procedure": "Wash sweet rice and put in a sauce pan to cook, add water and simmer until all the water has evaporated and sweet rice is done. Serve with fresh grated coconut and sugar.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Puto Puti (1)",
    "ingredients": "1 _ cup flour\n 1 _ cup rice flour\n 1 cup water\n 1 _ cup sugar\n 2 _ tsps baking powder\n 1 cup milk\n 1 egg",
    "procedure": "Beat the egg, then add the milk. Sift all the dry ingredients then mix with the egg, milk and water. Grease muffin pans and steam for about 10-15 minutes. Serve with grated coconuts.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Puto Puti (2)",
    "ingredients": "1 cup rice powder\n 3 tsps baking powder\n 1 _ cups water\n _ cup sugar\n _ tsp salt",
    "procedure": "Combine the rice powder with water, sugar, baking powder, and salt and mix until it has a thick consistency. Blend thoroughly and pour into molds _ full. Steam about half an hour or until done. Serve with fresh grated coconut.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Rellano Alimasag",
    "ingredients": "6 cooked crabs\n 1 clove garlic\n 1 small onion, chopped\n 1 medium sized tomato, fine\n 2 eggs\n Salt and white pepper",
    "procedure": "Remove the meat of the crab from its shell. Set aside. Saute garlic, onion, tomato and crab meat. Separate the yolk from the whites. Beat the white until stiff. Add the yolk. Place about a tbsp of egg over the stuffed crab and fry.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Roast chicken",
    "ingredients": "1 large chicken, 3 to 4 lbs \n 1 large onion, whole\n 1 apple peeled\n 1 small can asparagus\n 4 chestnuts\n 1 lemon\n _ cup soy sauce\n Dash garlic and salt",
    "procedure": "Clean the chicken. Rub it with the mixture of lemon juice and soy sauce and marinate it for one half hour. In a roaster rack, place the chicken stuffed with apple, onion, asparagus, chestnuts garlic and salt. Bake at 375C oven for _ hour until the chicken is brown and done.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Salted duck eggs",
    "ingredients": "Duck eggs\n Salt\n Water",
    "procedure": "1 cups salt to every 5 cups water. Make enough to cover the eggs and let it stand in the mixture for 21 days. Boil the eggs after removing from the water. If chicken eggs are used, soak only for 15 days.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Sauteed Chicaro with Sotanghon",
    "ingredients": "1 lb fresh chicharo\n _ lb shrimp, shelled and deveined\n _ lbs pork cut into short narrow strips\n 1 small onion, diced\n 1 clove garlic, crushed\n Sotanghon, patis, pepper and accent",
    "procedure": "Clean and devein the shrimps and cut lengthwise \n Boil the pork until tender and cut in small narrow pieces. Soak the sotanghon in water until done. Saute garlic, onion, pork, shrimps and add the peapods. Cover for 5 minutes. Season with patis and pepper and accent to bring out the flavor of the peapods. Drain the sotangho, cut into short pieces and add to the meat. Bring to a boil and serve hot. Do not overcook the peapods.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Sauteed Chicken and Sotanghon",
    "ingredients": "1lb fresh chicken\n _ lb shrimp, shelled and deveined\n _ lb pork cut into short narrow strips\n 1 small onion, diced\n 1 clove garlic, crushed\n Sotanghon, patis, white pepper and accent",
    "procedure": "Clean and devein shrimps and cut lengthwise. Boil the pork until tender and cut in small narrow pieces. Soak the sotanghon in water until ready to cook. Saute garlic, onion, pork, shrimps and add the peapods. Cover for 5 minutes. Season with patis and pepper and the accent to bring out the flavor of the peapods. Drain the sotanghon, cut into short pieces and add to the meat. Bring to a boil and serve hot. Don�t overcook the peapods.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Shrimp Rebosado",
    "ingredients": "_ lb shrimps\n 1 egg\n 1 tsp baking powder\n _ cup cornstarch\n Lemon for juice\n Salt and pepper",
    "procedure": "Shell shrimps, devein and split back in half, being careful not to split completely. Marinate in lemon juice, salt and pepper for 15 minutes. Dip the shrimp in batter made from the mixture of the beaten egg, cornstarch, baking powder, lemon juice. Deep fat fry. Serve with lemon, catsup and salt.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Shrimp Sauteed",
    "ingredients": "1 lb shrimp\n 1 can coconut milk, fresh or frozen\n 1 tbsp patis\n 1 clove garlic, crushed",
    "procedure": "Remove the shrimps from the shell, devein and split in half\n Saute garlic, shrimps and coconut milk. Cook until shrimps are done and milk has curdled. Add patis.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Shrimp with cashews",
    "ingredients": "1 lb shrimp\n 1 can peas, drained\n _ lb roasted cashews\n 1 medium sized onion, diced\n 1 clove garlic, crushed\n Accent, salt and pepper",
    "procedure": "Shell, clean and devein shrimps. Cut lengthwise and set aside. Saute the garlic, onion, shrimp, peas and cashews. Season with accent, salt and pepper.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Sinukmani",
    "ingredients": "2 _ cups sweet rice\n 1 _ cups sugar\n 2 cans coconut milk or 2 coconuts",
    "procedure": "Grate the coconuts and squeeze without adding water. Set aside. Boil the coconut milk equal to 8 cups. Add the rice and cook until the rice is done. Then add the sugar. Flatten in a buttered pan and cut into squares before serving. Serve with grated coconut on top.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Smoked Ham",
    "ingredients": "1 bottle beer\n 1 big can pineapple juice\n Salt\n Black pepper\n Bay leaves\n Brown sugar",
    "procedure": "Boil the pineapple juice, sugar, beer, salt, black pepper and bay leaf. Insert fork into the ham. Add ham and let it boil til cooked and tender. Remove ham, set aside. Boil rest of mixture and pour over the ham mixture.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Spaghetti",
    "ingredients": "1 lb spaghetti\n 3lbs ground beef \n 1 large can tomato sauce\n _ green pepper, chopped\n 1 large onion, chopped\n 1 clove garlic, crushed\n Salt and pepper, accent\n Parmesan cheese, grated",
    "procedure": "Saute garlic, onion and meat in a pan and cook until meat is tender. Add the tomato, salt pepper and simmer for 1-2 minutes. When ready to serve, boil spaghetti in salt water and when the noodles are done, rinse in water and drain. Pour sauce over the spaghetti and serve with Parmesan cheese on top.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Spareribs",
    "ingredients": "3 lbs spareribs, beef or pork\n _ cup soy sauce\n 1 can tomato paste\n _ cup white vinegar\n _ cup water\n _ cup brown sugar\n 1 piece medium size ginger",
    "procedure": "Wash and cut ribs into serving pieces. Marinate in the vinegar, soy sauce, water, sugar and crushed ginger mixutre, about _ hour. Remove the ribs from the marinade mixture, add the tomato paste to the liquid. Parboil the ribs for 15 minutes. Place the ribs in a broiler pan and bake at 350 C for 20 minutes. Brush with the marinade mixture, turn ribs and continue to cook until the ribs are done.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Squash and coconut milk",
    "ingredients": "1 winter squash, medium sized\n 2 cloves garlic, crushed\n _ lbs shelled shrimp, cut lengthwise\n 1 can coconut milk\n Accent, salt and pepper",
    "procedure": "Pare(--) and cut squash into cubes. Saute the garlic and shrimps. Then add the squash. Cover and simmer until the squash is almost done. Add the coconut milk. Season with salt and pepper and simmer for a few minutes, stirring well.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Stuffed Eggplants",
    "ingredients": "4 medium sized eggplants\n 1 lb ground pork\n 1 clove garlic, crushed\n _ medium sized onion, chopped\n 1 small tomato chopped\n 2 eggs",
    "procedure": "Boil eggplants until cooked and remove the skin. Split lengthwise and set aside. Sautee garlic, onion, pork, salt and pepper to taste and cook until the pork is done. Separate the yolk of eggs. Beat the whites until stiff. Add the yolk and continue beating. Place part of the beaten eggs on a saucer. Spread the eggplant over it, fill with sauteed pork then cover it with the beaten eggs. Fry in small amount of fat on both sides.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Stuffed Peppers",
    "ingredients": "2 medium sized green pepper\n 1 lb ground pork\n 1 clove garlic, crushed\n 1 small onion, diced\n 2 eggs\n Salt and pepper",
    "procedure": "Cut the green peppers in half and remove the seeds. Boil enough water to cover the peppers. When the water is boiling, drop the pepper and cook for 5 minutes. Drain and set aside. Saute garlic, onion and pork. Season with salt and pepper and cook until done. Separate egg yolks from the whites. Beat the whites until stiff and add the yolks. Fill each half of the pepper with the meat mixture, add the beaten egg and fry each half until the egg is done.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Sumon recipe",
    "ingredients": "5 cups sweet rice\n 3 cups coconut milk\n 2 cups water\n Anise and white sugar",
    "procedure": "Mix ingredients and boil on slow fire until dry. Cover for 5 minutes then wrap the mixture. Syrup: _ cup brown sugar and _ cup water.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Tenderloin and Peapods",
    "ingredients": "_ lb tenderloin of beef cut into thin bite size pieces\n 1 clove garlic, sliced thin\n 1 medium sized onion, diced\n 1 inch sized fresh ginger, sliced thin\n _ lbs snow peapod\n 2 tsp soy sauce\n _ cup water\n 1 tbsp cornstarch\n 1 tbsp empanada\n Salt and pepper",
    "procedure": "Saute the garlic, onion, ginger and cook the thinly sliced beef about 5 minutes. Add the corn starch, mixed with the soy suace and water. Lastly add the peapods and the salt and pepper, cover and cook about five more minutes and remove from heat. Do not overcook.",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "Tort",
    "ingredients": "Shell: 2 bar butter, _ cream cheese and 2 cups of flour\n 1 cup of cream cheese\n 1 egg\n _ cup sugar\n 1 tsp vanilla\n 1 pineapple crushed",
    "procedure": "Chicken Cacciatore",
    "photo": "",
    "": ""
  },
  {
    "recipeName": "White Fish Pesa",
    "ingredients": "1 medium sized white fish\n 1 inch ginger, crushed\n 1 small onion, cut into 4\n 8 peppercorns\n 3 cups rice water\n _ small cabbage or bokchoy\n 1 stalk green onion or cebollin",
    "procedure": "Clean the fish and cut into serving pieces. Set aside. Boil rice water with the onions, ginger, peppercorn and salt. Add the fish, cabbage, pechay and green onions and let it come to a boil. Do not overcook the vegetables.",
    "photo": "",
    "": ""
  }  
]
}
